docs/blog/2020/01/12/hello-world.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-01-12 Sun 20:38 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Hello World</title>
<meta name="generator" content="Org mode">
<meta name="description" content="Hello world blog"
>
<meta name="keywords" content="org-mode, emacs, hello-world">
<link href="../../../../css/site.css" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<div class="nav">
  <input type="checkbox" id="show-menu" role="button">
  <label for="show-menu" class="show-menu f-right">Menu</label>
  <div id="menu">
    <ul class="f-left"><li>
        <a href="../../../../index.html" class="home">Home</a></li><li>
        <a href="../../../index.html" class="blog active">Blog</a></li><li>
        <a href="../../../../projects/index.html" class="code">Projects</a>
    </li></ul>
    <ul class="f-right"><li>
        <a href="" class="feed">Feed</a></li><li>
        <!-- <a href="" class="donate">Donate</a>   -->
    </li></ul>
  </div>
</div>
</div>
<div id="content">
<h1 class="title">Hello World</h1>
<p>
<span class="info Note:"> This is a demo page to test the features of this blog.
Don’t expect much here.  </span>
</p>

<p>
In the software world, everything begins with <code>Hello World</code>. This is
the blog's beginning.  Let’s see how this will go.  This page stands
to test the features of this blog.
</p>

<p>
This website has been completely designed using GNU Emacs. The static
web pages are written in Emacs org-mode and exported to HTML.
If you are not yet a <a href="https://www.gnu.org/software/emacs/">GNU Emacs</a> user, give it a try. It’s worth learning.
</p>

<p>
To begin with, let’s see how code blocks in different language will be handled.
This should be pretty smooth, and cool .
</p>

<div id="outline-container-org02241d5" class="outline-2">
<h2 id="org02241d5"><code>Hello World</code></h2>
<div class="outline-text-2" id="text-org02241d5">
<p>
How about showing some real content?  Have a look at a few
examples below.
</p>
</div>

<div id="outline-container-orgc5dfa12" class="outline-3">
<h3 id="orgc5dfa12">C Programming</h3>
<div class="outline-text-3" id="text-orgc5dfa12">
<p>
Let’s begin with <code>Hello World</code> in C Programming.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>(<span class="org-type">int</span> <span class="org-variable-name">argc</span>, <span class="org-type">char</span> *<span class="org-variable-name">argv</span>[])
{
  printf(<span class="org-string">"%s\n"</span>, <span class="org-string">"hello world\n"</span>);
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<p>
Save the above code into <code>hello.c</code>, then compile and run.
</p>

<div class="org-src-container">
<pre class="src src-sh">
<span class="org-comment-delimiter"># </span><span class="org-comment">Compile and run</span>
cc hello.c -o hello &amp;&amp; ./hello

<span class="org-comment-delimiter"># </span><span class="org-comment">An alternate way for the same.  If you are</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">wondering, no, you don't need any Makefile.</span>
make hello &amp;&amp; ./hello

</pre>
</div>
</div>
</div>

<div id="outline-container-org36cd36a" class="outline-3">
<h3 id="org36cd36a">Emacs lisp</h3>
<div class="outline-text-3" id="text-org36cd36a">
<p>
Now let’s try this in elisp.  The code below will print “Hello World!”
to the echo area.  To run the program, write the code in GNU Emacs,
put the cursor at end of the paren and press <span class="key"><span>C-x C-e</span></span>
(eval-last-sexp).
</p>

<div class="org-src-container">
<pre class="src src-elisp">(message <span class="org-string">"Hello World!"</span>)
<span class="org-comment-delimiter">;; </span><span class="org-comment">Put the cursor here  ^</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">
  <ul>
    <li>
      Last updated: 2020-01-12 Sun 15:47+5:30.
    </li>
  </ul>
</div>
</div>
</body>
</html>
